app/Controllers/GaleriController.php

SELECT *
FROM `images`
---
    public function getImages()
    {
        // Contoh data; kamu bisa ambil dari DB
        $data_img = $this->imageModel->findAll();