app/Controllers/NewsController.php

    public function index()
    {
        $listArtikel = new NewsModel();
        $articles = $listArtikel->select('articles.*, article_tag.*')->join('article_tag', 'articles.id = article_tag.article_id', 'left')->findAll();
---
SELECT `articles`.*, `article_tag`.*
FROM `articles`
LEFT JOIN `article_tag` ON `articles`.`id` = `article_tag`.`article_id`

    public function create()
    {
        $categoryModel = new CategoryArticleModel();

        return $this->render_dashboard('dashboard/artikel/artikel', [
            'title' => 'Artikel Page',
            'categories' => $categoryModel->findAll()
        ]);
---
SELECT *
FROM `articles`