app/Controllers/UploadController.php

SELECT *
FROM `images`
---
    public function index()
    {
        $data = array();
        $data['title'] = 'Upload Page';
        $data['images'] = $this->imageModel->findAll();